public class Main {
    public static void main(String[] args) {

        //1 уровень сложности: Задание

        //1. Перевести число 333 из шестнадцатиричной в десятичную
        //2. Разложить число 200345 на разряды в десятичной системе
        //3. Перевести 637 из десятичной в шестнадцатиричную и обратно (10->16 и 16->10)
        //4. Перевести 637 из десятичной в двоичную
        //5. 11100111 перевести в десятичную
        //6. Перевести 637 из десятичной в троичную

        //Выполнение ДЗ
        //1. 333=3*16^2=3*16^1=3*16^0=768+48+3=819
        //2. 200345=2*10^5+0*10^4+0*10^3+3*10^2+4*10^1+5*10^0=2*100000+0*10000+0*1000+3*100+2*10+5*1=
        //   =200000+0+0+300+20+5=200345
        //3. 637 -> 16-тиричную  = 27D
        //   637/16=39
        //   637%16=13
        //   39/16=2
        //   39%16=7
        //   2/16=0
        //   2%16=2
        //   обратно -> десятичную
        //   27D=2*16^2+7*16^1+13*16^0=512+112+13=637
        //4. 637 -> двоичную = 1001111101
        //   637/2=318
        //   637%2=1
        //   318/2=159
        //   318%2=0
        //   159/2=79
        //   159%2=1
        //   79/2=39
        //   79%2=1
        //   39/2=19
        //   39%2=1
        //   19/2=9
        //   19%2=1
        //   9/2=4
        //   9%2=1
        //   4/2=2
        //   4%2=0
        //   2/2=1
        //   2%2=0
        //   1/2=0
        //   1%2=1
        //5. 11100111 -> десятичную =1*2^7+1*2^6+1*2^5+0*2^4+0*2^3+1*2^2+1*2^1+1*2^0=
        //   =1*128+1*64+1*32+0*16+0*8+1*4+1*2+1*1=128+64+32+0+0+4+2+1=231
        //6. 637 -> троичную = 212121
        //   637/3=212
        //   637%3=1
        //   212/3=70
        //   212%3=2
        //   70/3=23
        //   70%3=1
        //   23/3=7
        //   23%3=2
        //   7/3=2
        //   7%3=1
        //   2/3=0
        //   2%3=2
        



    }
}
